{
  "id": 437064,
  "title": "Amazing Grace",
  "artist": "Aretha Franklin",
  "lyrics": "[Intro: Choir]\nWas blind, but now I see\n\n[Verse 1: Aretha Franklin]\nAmazing, amazing grace, how sweet the, the sound\nThat, that saved a, a wretch like me\nI, I once was, was lost, but, but now I, I'm found\nWas, was blind, but now, now I, I see\n\n[Verse 2: Aretha Franklin]\nThrough, through, through, through\nThrough many dangers, oh-oh, dangers, toils, woo Lord, toils and, and snares\nI, I've been right here in the midst of a heaven\nBut I'm ready, I've already\nJesus was with me and I've already called, yes, I have\n\n[Bridge: Aretha Franklin]\nIt was, it was, it was, it was, it was, it was grace amazing\nHas been with me, Lord, and let me see\nDon't you know it?\nAnd that same, that same old grace\nThey call it God's amazing, oh-oh, amazing\nMm, Amazing Grace\nIt was, it was, I want the world to know that it was\nIt was, it was, it was grace\nWoo-hoo, it was grace, Lord\nOh Lord, hath brought me, me so safe\nSo safe, so safe, so safe, so safe, so safe, so safe thus far\nAnd it won't be nothin' but that same Grace\nI know that it won't, that's gonna lead me at mine, right on, right on\nRight on, right on, right on home, yeah\n\n\n\n\n[Outro: Aretha Franklin &amp; <i>Choir</i>]\n<i>Safe</i>\n<i>Safe</i> (So safe)\n<i>Safe</i> (So safe)\n<i>Safe</i> (Safe with Jesus)\n<i>Safe</i> (So safe)\n<i>That same grace will lead me home</i> (That same grace will lead me home)\nOh, oh, oh, lead me safe, woo-hoo, hoo-hoo, oh, that grace\nThe Lord will lead me home\n<b>Thank you so much</b>",
  "url": "https://genius.com/Aretha-franklin-amazing-grace-lyrics",
  "imageUrl": "https://images.genius.com/8d1b504286cc8f1633728c1f39871dd3.1000x1000x1.jpg",
  "thumbnailUrl": "https://images.genius.com/8d1b504286cc8f1633728c1f39871dd3.300x300x1.jpg",
  "releaseDate": "July 1, 1972",
  "fetchedAt": "2025-10-16T02:44:20.662Z",
  "note": "For educational/personal use only. Ensure you have proper rights to use this content."
}